fenrir-naru/pikari/firmware/c8051f990.h
/*-----------------------------------------------------------------------------
C8051F990.H
Header file for Silabs C8051F980/1/2/3/5/6/7/8/9, C8051F990/1/6/7 devices.
-----------------------------------------------------------------------------*/

#ifndef __C8051F990_H__
#define __C8051F990_H__

#if !(defined(__SDCC) || defined(SDCC))
#define __sbit  unsigned char
#define __sfr   unsigned char
#define __sfr16 unsigned short
#define __at(x)
#define __interrupt(x)
#define __data
#define __xdata
#define __code
#else
#endif

/* SFRPage 0x80 and SFRPage 0xFF Registers */
__sfr __at (0x80) P0;             /* Port 0 Latch                             */
__sfr __at (0x81) SP;             /* Stack Pointer                            */
__sfr __at (0x82) DPL;            /* Data Pointer Low                         */
__sfr __at (0x83) DPH;            /* Data Pointer High                        */
__sfr __at (0x84) CRC0CN;         /* CRC0 Control                             */
__sfr __at (0x85) CRC0IN;         /* CRC0 Input                               */
__sfr __at (0x86) CRC0DAT;        /* CRC0 Data                                */
__sfr __at (0x87) PCON;           /* Power Control                            */
__sfr __at (0x88) TCON;           /* Timer/Counter Control                    */
__sfr __at (0x89) TMOD;           /* Timer/Counter Mode                       */
__sfr __at (0x8A) TL0;            /* Timer/Counter 0 Low                      */
__sfr __at (0x8B) TL1;            /* Timer/Counter 1 Low                      */
__sfr __at (0x8C) TH0;            /* Timer/Counter 0 High                     */
__sfr __at (0x8D) TH1;            /* Timer/Counter 1 High                     */
__sfr __at (0x8D) TOFFL;          /* Temperature Offset Low        (Page 0xF) */
__sfr __at (0x8E) CKCON;          /* Clock Control                            */
__sfr __at (0x8E) TOFFH;          /* Temperature Offset High       (Page 0xF) */
__sfr __at (0x8F) PSCTL;          /* Program Store R/W Control                */
__sfr __at (0x90) P1;             /* Port 1 Latch                             */
__sfr __at (0x91) TMR3CN;         /* Timer/Counter 3 Control                  */
__sfr __at (0x92) TMR3RLL;        /* Timer/Counter 3 Reload Low               */
__sfr __at (0x93) TMR3RLH;        /* Timer/Counter 3 Reload High              */
__sfr __at (0x94) TMR3L;          /* Timer/Counter 3 Low                      */
__sfr __at (0x95) TMR3H;          /* Timer/Counter 3 High                     */
__sfr __at (0x96) ADC0MX;         /* AMUX0 Channel Select                     */
__sfr __at (0x97) ADC0CF;         /* ADC0 Configuration                       */
__sfr __at (0x98) SCON0;          /* UART0 Control                            */
__sfr __at (0x99) P0DRV;          /* Port 0 Drive Strength                    */
__sfr __at (0x99) SBUF0;          /* UART0 Data Buffer             (Page 0xF) */
__sfr __at (0x9A) CRC0CNT;        /* CRC0 Automatic Flash Sector Count        */
__sfr __at (0x9B) CPT0CN;         /* Comparator0 Control                      */
__sfr __at (0x9B) P1DRV;          /* Port 1 Drive Strength         (Page 0xF) */
__sfr __at (0x9C) CRC0FLIP;       /* CRC0 Flip                                */
__sfr __at (0x9D) CPT0MD;         /* Comparator0 Mode Selection               */
__sfr __at (0x9D) P2DRV;          /* Port 2 Drive Strength         (Page 0xF) */
__sfr __at (0x9E) CRC0AUTO;       /* CRC0 Automatic Control                   */
__sfr __at (0x9F) CPT0MX;         /* Comparator0 MUX Selection                */
__sfr __at (0xA0) P2;             /* Port 2 Latch                             */
__sfr __at (0xA1) SPI0CFG;        /* SPI0 Configuration                       */
__sfr __at (0xA2) SPI0CKR;        /* SPI0 Clock Rate Control                  */
__sfr __at (0xA3) SPI0DAT;        /* SPI0 Data                                */
__sfr __at (0xA4) P0MDOUT;        /* Port 0 Output Mode Configuration         */
__sfr __at (0xA5) P1MDOUT;        /* Port 1 Output Mode Configuration         */
__sfr __at (0xA6) P2MDOUT;        /* Port 2 Output Mode Configuration         */
__sfr __at (0xA7) SFRPAGE;        /* SFR Page                                 */
__sfr __at (0xA8) IE;             /* Interrupt Enable                         */
__sfr __at (0xA9) CLKSEL;         /* Clock Select                             */
__sfr __at (0xAA) CS0CF;          /* CS0 Configuration                        */
__sfr __at (0xAB) CS0MX;          /* CS0 Mux Channel Select                   */
__sfr __at (0xAC) RTC0ADR;        /* RTC0 Address                             */
__sfr __at (0xAD) RTC0DAT;        /* RTC0 Data                                */
__sfr __at (0xAE) RTC0KEY;        /* RTC0 Key                                 */
__sfr __at (0xAF) CS0MD1;         /* CS0 Mode 1                               */
__sfr __at (0xB0) CS0CN;          /* CS0 Control                              */
__sfr __at (0xB1) OSCXCN;         /* External Oscillator Control              */
__sfr __at (0xB2) OSCICN;         /* Internal Oscillator Control              */
__sfr __at (0xB3) OSCICL;         /* Internal Oscillator Calibration          */
__sfr __at (0xB5) PMU0CF;         /* PMU0 Configuration                       */
__sfr __at (0xB5) PMU0MD;         /* PMU0 Mode                     (Page 0xF) */
__sfr __at (0xB6) FLSCL;          /* Flash Scale Register                     */
__sfr __at (0xB7) FLKEY;          /* Flash Lock And Key                       */
__sfr __at (0xB8) IP;             /* Interrupt Priority                       */
__sfr __at (0xB9) IREF0CF;        /* Current Reference IREF0 Configuration    */
                                                                /* (Page 0xF) */
__sfr __at (0xBA) ADC0AC;         /* ADC0 Accumulator Configuration           */
__sfr __at (0xBB) ADC0PWR;        /* ADC0 Burst Mode Power-Up Time            */
__sfr __at (0xBC) ADC0TK;         /* ADC0 Tracking Control                    */
__sfr __at (0xBD) ADC0L;          /* ADC0 Low                                 */
__sfr __at (0xBE) ADC0H;          /* ADC0 High                                */
__sfr __at (0xBF) P1MASK;         /* Port 1 Mask                              */
__sfr __at (0xC0) SMB0CN;         /* SMBus0 Control                           */
__sfr __at (0xC1) SMB0CF;         /* SMBus0 Configuration                     */
__sfr __at (0xC2) SMB0DAT;        /* SMBus0 Data                              */
__sfr __at (0xC3) ADC0GTL;        /* ADC0 Greater-Than Compare Low            */
__sfr __at (0xC4) ADC0GTH;        /* ADC0 Greater-Than Compare High           */
__sfr __at (0xC5) ADC0LTL;        /* ADC0 Less-Than Compare Word Low          */
__sfr __at (0xC6) ADC0LTH;        /* ADC0 Less-Than Compare Word High         */
__sfr __at (0xC7) P0MASK;         /* Port 0 Mask                              */
__sfr __at (0xC8) TMR2CN;         /* Timer/Counter 2 Control                  */
__sfr __at (0xC9) REG0CN;         /* Voltage Regulator (REG0) Control         */
__sfr __at (0xCA) TMR2RLL;        /* Timer/Counter 2 Reload Low               */
__sfr __at (0xCB) TMR2RLH;        /* Timer/Counter 2 Reload High              */
__sfr __at (0xCC) TMR2L;          /* Timer/Counter 2 Low                      */
__sfr __at (0xCD) TMR2H;          /* Timer/Counter 2 High                     */
__sfr __at (0xCE) PMU0FL;         /* PMU0 Flag Register                       */
__sfr __at (0xCF) P1MAT;          /* Port 1 Match                             */
__sfr __at (0xD0) PSW;            /* Program Status Word                      */
__sfr __at (0xD1) REF0CN;         /* Voltage Reference Control                */
__sfr __at (0xD2) CS0SCAN0;       /* CS0 Scan Channel Enable 0                */
__sfr __at (0xD3) CS0SCAN1;       /* CS0 Scan Channel Enable 1                */
__sfr __at (0xD4) P0SKIP;         /* Port 0 Skip                              */
__sfr __at (0xD5) P1SKIP;         /* Port 1 Skip                              */
__sfr __at (0xD6) IREF0CN;        /* Current Reference IREF0 Control          */
__sfr __at (0xD7) P0MAT;          /* Port 0 Match                             */
__sfr __at (0xD8) PCA0CN;         /* PCA0 Control                             */
__sfr __at (0xD9) PCA0MD;         /* PCA0 Mode                                */
__sfr __at (0xDA) PCA0CPM0;       /* PCA0 Module 0 Mode Register              */
__sfr __at (0xDB) PCA0CPM1;       /* PCA0 Module 1 Mode Register              */
__sfr __at (0xDC) PCA0CPM2;       /* PCA0 Module 2 Mode Register              */
__sfr __at (0xDD) CS0SS;          /* CS0 Auto-Scan Start Channel              */
__sfr __at (0xDE) CS0SE;          /* CS0 Auto-Scan End Channel                */
__sfr __at (0xDE) CS0PM;          /* CS0 Power Management          (Page 0xF) */
__sfr __at (0xDF) PCA0PWM;        /* PCA0 PWM Configuration                   */
__sfr __at (0xE0) ACC;            /* Accumulator                              */
__sfr __at (0xE1) XBR0;           /* Port I/O Crossbar Control 0              */
__sfr __at (0xE2) XBR1;           /* Port I/O Crossbar Control 1              */
__sfr __at (0xE2) REVID;          /* Revision ID                   (Page 0xF) */
__sfr __at (0xE3) XBR2;           /* Port I/O Crossbar Control 2              */
__sfr __at (0xE3) DEVICEID;       /* Device ID                     (Page 0xF) */
__sfr __at (0xE4) IT01CF;         /* INT0/INT1 Configuration                  */
__sfr __at (0xE5) FLWR;           /* Flash Write Only Register                */
__sfr __at (0xE6) EIE1;           /* Extended Interrupt Enable 1              */
__sfr __at (0xE7) EIE2;           /* Extended Interrupt Enable 2              */
__sfr __at (0xE8) ADC0CN;         /* ADC0 Control                             */
__sfr __at (0xE9) PCA0CPL1;       /* PCA0 Capture 1 Low                       */
__sfr __at (0xEA) PCA0CPH1;       /* PCA0 Capture 1 High                      */
__sfr __at (0xEB) PCA0CPL2;       /* PCA0 Capture 2 Low                       */
__sfr __at (0xEC) PCA0CPH2;       /* PCA0 Capture 2 High                      */
__sfr __at (0xED) CS0DL;          /* CS0 Data Low Byte                        */
__sfr __at (0xEE) CS0DH;          /* CS0 Data High Byte                       */
__sfr __at (0xEF) RSTSRC;         /* Reset Source Configuration/Status        */
__sfr __at (0xF0) B;              /* B Register                               */
__sfr __at (0xF1) P0MDIN;         /* Port 0 Input Mode Configuration          */
__sfr __at (0xF2) P1MDIN;         /* Port 1 Input Mode Configuration          */
__sfr __at (0xF3) CS0MD2;         /* CS0 Mode 2                               */
__sfr __at (0xF3) CS0MD3;         /* CS0 Mode 3                    (Page 0xF) */
__sfr __at (0xF4) SMB0ADR;        /* SMBus Slave Address                      */
__sfr __at (0xF5) SMB0ADM;        /* SMBus Slave Address Mask                 */
__sfr __at (0xF6) EIP1;           /* Extended Interrupt Priority 1            */
__sfr __at (0xF7) EIP2;           /* Extended Interrupt Priority 2            */
__sfr __at (0xF8) SPI0CN;         /* SPI0 Control                             */
__sfr __at (0xF9) PCA0L;          /* PCA0 Counter Low                         */
__sfr __at (0xFA) PCA0H;          /* PCA0 Counter High                        */
__sfr __at (0xFB) PCA0CPL0;       /* PCA0 Capture 0 Low                       */
__sfr __at (0xFC) PCA0CPH0;       /* PCA0 Capture 0 High                      */
__sfr __at (0xFD) CS0THL;         /* CS0 Comparator Threshold Low Byte        */
__sfr __at (0xFE) CS0THH;         /* CS0 Comparator Threshold High Byte       */
__sfr __at (0xFF) VDM0CN;         /* VDD Monitor Control                      */

/* 16-Bit Register definitions */
__sfr16 __at (0x8382) DP;         /* Data Pointer                             */
__sfr16 __at (0x8E8D) TOFF;       /* Temperature Sensor Offset                */
__sfr16 __at (0x9392) TMR3RL;     /* Timer 3 Reload                           */
__sfr16 __at (0x9594) TMR3;       /* Timer 3 Counter                          */
__sfr16 __at (0xBEBD) ADC0;       /* ADC0 Data                                */
__sfr16 __at (0xC4C3) ADC0GT;     /* ADC0 Greater-Than Compare                */
__sfr16 __at (0xC6C5) ADC0LT;     /* ADC0 Less-Than Compare                   */
__sfr16 __at (0xCBCA) TMR2RL;     /* Timer 2 Reload                           */
__sfr16 __at (0xCDCC) TMR2;       /* Timer 2 Counter                          */
__sfr16 __at (0xEAE9) PCA0CP1;    /* PCA0 Module 1 Capture/Compare            */
__sfr16 __at (0xECEB) PCA0CP2;    /* PCA0 Module 2 Capture/Compare            */
__sfr16 __at (0xEEED) CS0D;       /* CS0 Threshold                            */
__sfr16 __at (0xFAF9) PCA0;       /* PCA0 Counter                             */
__sfr16 __at (0xFCFB) PCA0CP0;    /* PCA0 Module 0 Capture/Compare            */
__sfr16 __at (0xFEFD) CS0TH;      /* CS0 Threshold                            */

/* Bit Definitions for SFRPage 0x00 and SFRPage 0x0F Registers */
/* TCON 0x88 */
__sbit __at (0x88 + 7) TF1;       /* Timer 1 Overflow Flag                    */
__sbit __at (0x88 + 6) TR1;       /* Timer 1 On/Off Control                   */
__sbit __at (0x88 + 5) TF0;       /* Timer 0 Overflow Flag                    */
__sbit __at (0x88 + 4) TR0;       /* Timer 0 On/Off Control                   */
__sbit __at (0x88 + 3) IE1;       /* Ext. Interrupt 1 Edge Flag               */
__sbit __at (0x88 + 2) IT1;       /* Ext. Interrupt 1 Type                    */
__sbit __at (0x88 + 1) IE0;       /* Ext. Interrupt 0 Edge Flag               */
__sbit __at (0x88 + 0) IT0;       /* Ext. Interrupt 0 Type                    */

/* SCON0 0x98 */
__sbit __at (0x98 + 7) S0MODE;    /* UART0 Mode                               */
                                    /* Bit6 UNUSED */
__sbit __at (0x98 + 5) MCE0;      /* UART0 MCE                                */
__sbit __at (0x98 + 4) REN0;      /* UART0 RX Enable                          */
__sbit __at (0x98 + 3) TB80;      /* UART0 TX Bit 8                           */
__sbit __at (0x98 + 2) RB80;      /* UART0 RX Bit 8                           */
__sbit __at (0x98 + 1) TI0;       /* UART0 TX Interrupt Flag                  */
__sbit __at (0x98 + 0) RI0;       /* UART0 RX Interrupt Flag                  */

/* IE 0xA8 */
__sbit __at (0xA8 + 7) EA;        /* Global Interrupt Enable                  */
__sbit __at (0xA8 + 6) ESPI0;     /* SPI0 Interrupt Enable                    */
__sbit __at (0xA8 + 5) ET2;       /* Timer 2 Interrupt Enable                 */
__sbit __at (0xA8 + 4) ES0;       /* UART0 Interrupt Enable                   */
__sbit __at (0xA8 + 3) ET1;       /* Timer 1 Interrupt Enable                 */
__sbit __at (0xA8 + 2) EX1;       /* External Interrupt 1 Enable              */
__sbit __at (0xA8 + 1) ET0;       /* Timer 0 Interrupt Enable                 */
__sbit __at (0xA8 + 0) EX0;       /* External Interrupt 0 Enable              */

/* CS0CN 0xB0 */
__sbit __at (0xB0 + 7) CS0EN;     /* CS0 Enable                               */
__sbit __at (0xB0 + 6) CS0EOS;    /* CS0 End Of Scan Interrupt Flag           */
__sbit __at (0xB0 + 5) CS0INT;    /* CS0 End Of Conversion Interrupt Flag     */
__sbit __at (0xB0 + 4) CS0BUSY;   /* CS0 Busy Bit                             */
__sbit __at (0xB0 + 3) CS0CMPEN;  /* CS0 Digital Comparator Enable            */
__sbit __at (0xB0 + 2) CS0BBB;    /* CS0 BBB                                  */
__sbit __at (0xB0 + 1) CS0AAA;    /* CS0 AAA                                  */
__sbit __at (0xB0 + 0) CS0CMPF;   /* CS0 Enable                               */

/* IP 0xB8 */
                                    /* Bit7 UNUSED */
__sbit __at (0xB8 + 6) PSPI0;     /* SPI0 Priority                            */
__sbit __at (0xB8 + 5) PT2;       /* Timer 2 Priority                         */
__sbit __at (0xB8 + 4) PS0;       /* UART0 Priority                           */
__sbit __at (0xB8 + 3) PT1;       /* Timer 1 Priority                         */
__sbit __at (0xB8 + 2) PX1;       /* External Interrupt 1 Priority            */
__sbit __at (0xB8 + 1) PT0;       /* Timer 0 Priority                         */
__sbit __at (0xB8 + 0) PX0;       /* External Interrupt 0 Priority            */

/* SMB0CN 0xC0 SFR Page=0 */
__sbit __at (0xC0 + 7) MASTER;    /* SMBus0 Master/Slave                      */
__sbit __at (0xC0 + 6) TXMODE;    /* SMBus0 Transmit Mode                     */
__sbit __at (0xC0 + 5) STA;       /* SMBus0 Start Flag                        */
__sbit __at (0xC0 + 4) STO;       /* SMBus0 Stop Flag                         */
__sbit __at (0xC0 + 3) ACKRQ;     /* SMBus0 Acknowledge Request               */
__sbit __at (0xC0 + 2) ARBLOST;   /* SMBus0 Arbitration Lost                  */
__sbit __at (0xC0 + 1) ACK;       /* SMBus0 Acknowledge Flag                  */
__sbit __at (0xC0 + 0) SI;        /* SMBus0 Interrupt Pending Flag            */

/* TMR2CN 0xC8 SFR Page=0 */
__sbit __at (0xC8 + 7) TF2H;      /* Timer 2 High Byte Overflow Flag          */
__sbit __at (0xC8 + 6) TF2L;      /* Timer 2 Low Byte Overflow Flag           */
__sbit __at (0xC8 + 5) TF2LEN;    /* Timer 2 Low Byte Interrupt Enable        */
__sbit __at (0xC8 + 4) TF2CEN;    /* Timer 2 Lfo Capture Enable               */
__sbit __at (0xC8 + 3) T2SPLIT;   /* Timer 2 Split Mode Enable                */
__sbit __at (0xC8 + 2) TR2;       /* Timer 2 On/Off Control                   */
__sbit __at (0xC8 + 1) T2RCLK;    /* Timer 2 Capture Mode                     */
__sbit __at (0xC8 + 0) T2XCLK;    /* Timer 2 External Clock Select            */

/* PSW 0xD0 */
__sbit __at (0xD0 + 7) CY;        /* Carry Flag                               */
__sbit __at (0xD0 + 6) AC;        /* Auxiliary Carry Flag                     */
__sbit __at (0xD0 + 5) F0;        /* User Flag 0                              */
__sbit __at (0xD0 + 4) RS1;       /* Register Bank Select 1                   */
__sbit __at (0xD0 + 3) RS0;       /* Register Bank Select 0                   */
__sbit __at (0xD0 + 2) OV;        /* Overflow Flag                            */
__sbit __at (0xD0 + 1) F1;        /* User Flag 1                              */
__sbit __at (0xD0 + 0) P;         /* Accumulator Parity Flag                  */

/* PCA0CN 0xD8 */
__sbit __at (0xD8 + 7) CF;        /* PCA0 Counter Overflow Flag               */
__sbit __at (0xD8 + 6) CR;        /* PCA0 Counter Run Control Bit             */
__sbit __at (0xD8 + 5) CCF5;      /* PCA0 Module 5 Interrupt Flag             */
__sbit __at (0xD8 + 4) CCF4;      /* PCA0 Module 4 Interrupt Flag             */
__sbit __at (0xD8 + 3) CCF3;      /* PCA0 Module 3 Interrupt Flag             */
__sbit __at (0xD8 + 2) CCF2;      /* PCA0 Module 2 Interrupt Flag             */
__sbit __at (0xD8 + 1) CCF1;      /* PCA0 Module 1 Interrupt Flag             */
__sbit __at (0xD8 + 0) CCF0;      /* PCA0 Module 0 Interrupt Flag             */

/* ADC0CN 0xE8 */
__sbit __at (0xE8 + 7) AD0EN;     /* ADC0 Enable                              */
__sbit __at (0xE8 + 6) BURSTEN;   /* ADC0 Burst Enable                        */
__sbit __at (0xE8 + 5) AD0INT;    /* ADC0 EOC Interrupt Flag                  */
__sbit __at (0xE8 + 4) AD0BUSY;   /* ADC0 Busy Flag                           */
__sbit __at (0xE8 + 3) AD0WINT;   /* ADC0 Window Interrupt Flag               */
__sbit __at (0xE8 + 2) AD0CM2;    /* ADC0 Convert Start Mode Bit 2            */
__sbit __at (0xE8 + 1) AD0CM1;    /* ADC0 Convert Start Mode Bit 1            */
__sbit __at (0xE8 + 0) AD0CM0;    /* ADC0 Convert Start Mode Bit 0            */

/* SPI0CN 0xF8 */
__sbit __at (0xF8 + 7) SPIF0;     /* SPI0 Interrupt Flag                      */
__sbit __at (0xF8 + 6) WCOL0;     /* SPI0 Write Collision Flag                */
__sbit __at (0xF8 + 5) MODF0;     /* SPI0 Mode Fault Flag                     */
__sbit __at (0xF8 + 4) RXOVRN0;   /* SPI0 RX Overrun Flag                     */
__sbit __at (0xF8 + 3) NSS0MD1;   /* SPI0 Slave Select Mode 1                 */
__sbit __at (0xF8 + 2) NSS0MD0;   /* SPI0 Slave Select Mode 0                 */
__sbit __at (0xF8 + 1) TXBMT0;    /* SPI0 TX Buffer Empty Flag                */
__sbit __at (0xF8 + 0) SPI0EN;    /* SPI0 Enable                              */


/* Interrupt Priorities */
#define INTERRUPT_INT0             0   /* External Interrupt 0                */
#define INTERRUPT_TIMER0           1   /* Timer0 Overflow                     */
#define INTERRUPT_INT1             2   /* External Interrupt 1                */
#define INTERRUPT_TIMER1           3   /* Timer1 Overflow                     */
#define INTERRUPT_UART0            4   /* Serial Port 0                       */
#define INTERRUPT_TIMER2           5   /* Timer2 Overflow                     */
#define INTERRUPT_SPI0             6   /* Serial Peripheral Interface 0       */
#define INTERRUPT_SMBUS0           7   /* SMBus0 Interface                    */
#define INTERRUPT_RTC0ALARM        8   /* RTC0 (SmaRTClock) Alarm             */
#define INTERRUPT_ADC0_WINDOW      9   /* ADC0 Window Comparison              */
#define INTERRUPT_ADC0_EOC         10  /* ADC0 End Of Conversion              */
#define INTERRUPT_PCA0             11  /* PCA0 Peripheral                     */
#define INTERRUPT_COMPARATOR0      12  /* Comparator0                         */
#define INTERRUPT_TIMER3           14  /* Timer3 Overflow                     */
#define INTERRUPT_VDDMON           15  /* VDD Monitor Early Warning           */
#define INTERRUPT_PORT_MATCH       16  /* Port Match                          */
#define INTERRUPT_RTC0_OSC_FAIL    17  /* RTC0 (smaRTClock) Osc. Fail         */
#define INTERRUPT_CS0_EOC          19  /* CS0 End of Conversion               */
#define INTERRUPT_CS0_DC           20  /* CS0 Digital Comparator              */
#define INTERRUPT_CS0_EOS          21  /* CS0 End of Scan                     */

#endif /* #define __C8051F990_H__                                             */
